#pragma once

#include <iostream>


//题目顺序为洛谷的训练题单
void B2002() {
	std::cout << "Hello,World!" << std::endl; //使用 cout 输出 Hello,World! 的内容
}

void B2025() {
    //按要求输出，注意空格捏
    std::cout << "  *" << std::endl;
    std::cout << " ***" << std::endl;
    std::cout << "*****" << std::endl;
    std::cout << " ***" << std::endl;
    std::cout << "  *" << std::endl;
}

void P1000() {
    //居然是更多的输出吗，那没办法了，开输()
    std::cout << "                ******** " << std::endl;
    std::cout << "               ************ " << std::endl;
    std::cout << "               ####....#. " << std::endl;
    std::cout << "             #..###.....##.... " << std::endl;
    std::cout << "             ###.......######              ###            ###" << std::endl;
    std::cout << "                ...........               #...#          #...# " << std::endl;
    std::cout << "               ##*#######                 #.#.#          #.#.# " << std::endl;
    std::cout << "            ####*******######             #.#.#          #.#.# " << std::endl;
    std::cout << "           ...#***.****.*###....          #...#          #...# " << std::endl;
    std::cout << "           ....**********##.....           ###            ### " << std::endl;
    std::cout << "           ....****    *****.... " << std::endl;
    std::cout << "             ####        #### " << std::endl;
    std::cout << "           ######        ###### " << std::endl;
    std::cout << "############################################################## " << std::endl;
    std::cout << "#...#......#.##...#......#.##...#......#.##------------------# " << std::endl;
    std::cout << "###########################################------------------# " << std::endl;
    std::cout << "#..#....#....##..#....#....##..#....#....##################### " << std::endl;
    std::cout << "##########################################    #----------# " << std::endl;
    std::cout << "#.....#......##.....#......##.....#......#    #----------# " << std::endl;
    std::cout << "##########################################    #----------# " << std::endl;
    std::cout << "#.#..#....#..##.#..#....#..##.#..#....#..#    #----------# " << std::endl;
    std::cout << "##########################################    ############ " << std::endl;
}